app/controllers/post_images_controller.rb

SELECT  "post_images".* FROM "post_images" ORDER BY "post_images"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
---
  def index
    @post_images = PostImage.page(params[:page]).reverse_order